In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = {'id':[1,2,3,4,5],
      'name':['jomn','jim','henry','sam','max'],
      'salary':[70000,90000,80000,60000,90000],
      'departmentId':[1,1,2,2,1]}
df1 = pd.DataFrame(df1)

In [3]:
df2 = pd.DataFrame({'id':[1,2],
                   'name':['IT', 'Sales']})
df2

   id   name
0   1     IT
1   2  Sales

In [4]:
df2.rename(columns={'id':'departmentId', 'name':'dname'}, inplace=True)

In [5]:
df2.head()

   departmentId  dname
0             1     IT
1             2  Sales

In [6]:
df3 = pd.merge(df1, df2, on='departmentId')
df3

   id   name  salary  departmentId  dname
0   1   jomn   70000             1     IT
1   2    jim   90000             1     IT
2   3  henry   80000             2  Sales
3   4    sam   60000             2  Sales
4   5    max   90000             1     IT

In [11]:
groupdf = df3.groupby('dname')['salary'].max()
groupdf

dname
IT       90000
Sales    80000
Name: salary, dtype: int64

In [16]:
groupdf_salary = df3.groupby('dname')['salary'].transform('max')
groupdf_attempt3 = df3[df3['salary'] == groupdf_salary]
groupdf_attempt3[['dname', 'name', 'salary']]

   dname   name  salary
1     IT    jim   90000
2  Sales  henry   80000
4     IT    max   90000